# Intro to Data Visualizations with Python

# Part 1

1. Import libraries (direction 3)

2. Import data (direction 3)

3. Wrangle data (direction 4)

4. Consistency checks (direction 5)

6. Merge data (direction 6)

7. Export data (direction 8)

# 1. Import libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 2. Import data

In [2]:
# Create a path

path = r'/Users/marie/Documents/CareerFoundry/09-2021 Instacart Basket Analysis'

In [3]:
# Import file from Original data folder

cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv' ))

# 3. Wrangle data

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [4]:
# Check the dataframe

cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Rename columns to the same format

cust = cust.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age'})

In [6]:
# Check the output

cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

There are no columns I want to drop

# 4. Consistency checks

Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

**Mixed-type data**

In [7]:
# Checking for columns with mixed-type data

for col in cust.columns.tolist():
  weird = (cust[[col]].applymap(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

first_name

There are mixed-type data in the column "first_name"

In [8]:
# Convert data type in column "first_name" to string

cust['first_name'] = cust['first_name'].astype('str')

In [9]:
# Checking the result

for col in cust.columns.tolist():
  weird = (cust[[col]].applymap(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

No more mixed data types in the dataframe

**Missing values**

In [10]:
# Checking for missing values in dataframe

cust.isnull().sum()

user_id         0
first_name      0
last_name       0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

There are no missing values in the dataframe

**Duplicates**

In [11]:
# Checking for duplicates and creating a new subset for the eventual duplicates

dups = cust[cust.duplicated()]

In [12]:
# Check the output

dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

There are no duplicates in the dataframe

# 6. Merge data

Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type!

In [13]:
# Import ords_prods from Prepared Data

ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_actual.pkl'))

In [14]:
# Check the name of the columns to find a common key

ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_days,Busiest days,busiest_period_of_day,max_order,loyalty_flag
0,2539329,1,1,2,8,NaN,196,1,0,both,...,77.0,7.0,9.0,Mid range product,Regularly busy,Regular days,Regularly busy,Average orders,10,New customer
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,91.0,16.0,12.5,Mid range product,Regularly busy,Regular days,Regularly busy,Average orders,10,New customer
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,23.0,19.0,4.4,Low range product,Regularly busy,Regular days,Regularly busy,Average orders,10,New customer
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,23.0,19.0,4.7,Low range product,Regularly busy,Regular days,Regularly busy,Average orders,10,New customer
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,54.0,17.0,1.0,Low range product,Regularly busy,Regular days,Regularly busy,Average orders,10,New customer

In [15]:
# Check the shape of the two dataframes before merging

ords_prods.shape

(32435059, 23)

In [16]:
cust.shape

(206209, 10)

In [18]:
# Merge cust onto ords_prods, with "user_id" as the common key 

merged = ords_prods.merge(cust, on = ['user_id'], how = 'left')

In [19]:
# Print the new dataframe

merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,loyalty_flag,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,2539329,1,1,2,8,NaN,196,1,0,both,...,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [20]:
# Check shape of the new dataframe

merged.shape

(32435059, 32)

It looks correct. After merging the new dataframe has 9 more columns (it is 10 columns in the cust dataframe but one is common (user_id) with the ords_prods dataframe.

# 7. Export data

Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [21]:
# Export merged file in pickle format to Prepared data

merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_current.pkl'))